// Задача вывода Hello World!
// Console.WriteLine("123 Hello, World!");

// Задача вывода приветствия пользователя.
//Console.WriteLine("Введите Ваше имя ");
//string username=Console.ReadLine();
//Console.Write("Привет, ");
//Console.Write(username);
//Console.Write("!");

//