// Задача вывода Hello World!
// Console.WriteLine("123 Hello, World!");

// Задача вывода приветствия пользователя.
//Console.WriteLine("Введите Ваше имя ");
//string username=Console.ReadLine();
//Console.Write("Привет, ");
//Console.Write(username);
//Console.Write("!");

//написать программу, выводящую сумму двух натуральных чисел на экран.

//Console.WriteLine("Введите два числа ");
//int numberA=Console.ReadLine();
//int numberB=Console.ReadLine();
//Console.WriteLine(numberA+numberB);

//написать программу выводящую частное двух чисел.
int numberA = new Random().Next(1,10);
int numberB = new Random().Next(1,10);
Console.WriteLine(numberA);
Console.WriteLine(numberB);
int result = numberA+numberB;
Console.WriteLine(result);
